from scipy.stats import exponweib
import numpy as np
import statsmodels.api as sm
import matplotlib.pyplot as plt
import math

def wblfit(data):
	cdf = sm.distributions.ECDF(data)
	data_min = min(data)
	data_max = max(data)
	x = np.linspace(data_min+1.0,data_max-1.0,num=100,endpoint=True)
	X = np.log(x) # X = ln(x)
	Y = np.log(-np.log(1.0-cdf(x))) # Y = ln[-ln[1-F(x)]]
	coef = np.polyfit(X,Y,1)

	#形状参数
	theta = coef[0]
	#尺度参数
	beta = math.exp(-coef[1]/theta)

	fcdf = lambda x: 1-np.exp(-np.power(x/beta,theta))
	return fcdf,theta,beta


# 用exponweib生成符合weibull分布的随机数组
# n = 100     # number of samples
# k = 2.89    # shape
# lam = 1.95  # scale
#obs = exponweib.rvs(k, lam, scale=20,size=n)
obs=[17.93588035, 36.41668949, 27.86428848, 19.20215317, 14.62140298,
       17.3276019 , 19.90145708, 12.87377079, 29.51112477, 24.67808805,
       22.10105565, 32.2759882 , 35.81282205, 27.36248671, 17.05626098,
       22.63145892, 10.35038246, 15.81633949, 34.27723345, 29.86930199,
       19.19389921, 25.39060805, 34.61792692, 25.57587925, 31.51381527,
       29.01878657, 25.28715418, 20.12670207, 14.46307992, 28.84428513,
       46.77970145, 33.1159159 , 21.60262246, 27.01868094, 16.16621617,
       23.28941698, 30.99081206, 25.12966832, 27.98561247, 27.41990514,
       16.52415218, 18.77637951, 28.26857097, 46.39874075, 19.80831338,
       12.11878674, 33.1448367 , 22.05862365, 18.96280391, 31.16028794,
       15.87946049, 27.35170271, 31.32538565, 23.74403007, 17.43587458,
       18.6219512 , 24.55670779, 21.57814144, 34.45009506, 36.58945633,
       18.17681221, 25.86010693, 33.89106025, 14.64977338, 35.75566041,
       27.33308249, 24.80859785, 28.15870758, 13.48923001, 33.17545607,
       14.89969547, 17.7670959 , 31.03805452, 32.92609023, 28.69232711,
       29.34081462, 11.42831889, 29.16080325, 13.33924548, 34.12402732,
       34.4956252 , 19.13439949, 42.23851228, 41.26636486, 31.70129097,
       18.37208817, 22.61472603, 12.85519207, 36.38910118, 57.87694244,
       14.96787698, 24.51957247, 27.90943196, 26.56143831, 22.83057757,
       21.07291988, 16.75233691, 24.21811389, 18.69926621, 20.05146896]
ocdf = sm.distributions.ECDF(obs)

# 拟合
fcdf,beta,theta = wblfit(obs) 

# 画图
x = np.linspace(0,50,num=100,endpoint=True)
y1 = ocdf(x)
y2 = fcdf(x)

plt.figure()
plt.plot(x,y1,color='blue',label='O')
plt.plot(x,y2,color='black',label='F')
plt.legend()
plt.show()
plt.show()