import joblib

###读取模型
def f_get_read_itr(gaosu_moxing_name,jiaoqu_moxing_name):
    ###模型路径定义
    filepath_gaosu = './pkl_path/'+gaosu_moxing_name
    filepath_jiaoqu_shanqu = './pkl_path/'+jiaoqu_moxing_name
    ###加载模型
    itr_gaoshu= joblib.load(filepath_gaosu)
    itr_jiaoqu_shanqu= joblib.load(filepath_jiaoqu_shanqu)

    return itr_gaoshu,itr_jiaoqu_shanqu

def bianshi(moxing1,moxing2,tezhengchanshu,yuzhi=[0.6,0.65]): #tezhengchanshu很多 要有提取过程      阈值默认要大于0.5
 #输出：index -1:不在该城市  0在该城市   1-4 :市区                    高速  郊区 山区
        ###加载模型
        itr_gaoshu = moxing1
        itr_jiaoqu_shanqu = moxing2
        ###特征参数筛选
        # tezhengcanshu_gaosu = ['运行时间','运行距离','运行速度','加速时间','减速时间','匀速时间','怠速时间','加速比例','减速比例','匀速比例','怠速比例',
        # '最大速度','平均速度','速度标准偏差','最大加速度','加速段平均加速度','正加速度标准差','最大减速度','减速段平均减速度','负减速度标准差',
        # '平均dudt','dudt标准偏差','相对正加速度','speed0to20','speed20to40','speed40to60','speed60to80','speed80to100','speed100tomax','speed0',
        # 'speed0to10','speed10to20','speed20to30','speed30to40','speed40to50','speed50to60','speed60to70','speed70to80','speed80to90','speed90to100',
        # 'speed100to110','speed110to120','speedup120','加速数目','减速数目','匀速数目','停车数目','转矩标准差','平均正转矩','平均负转矩','最大正转矩',
        # '最大负转矩','怠速段平均转矩','运行段平均转矩','正转矩时间比例','负转矩时间比例','转矩增加时最大波动量','转矩减小时最大波动量','转矩波动标准差',
        # '转矩增加时平均波动量','转矩减小时平均波动量','横摆角速度绝对值最大值','侧向加速绝对值最大值','制动次数','加速段时长','百公里能耗','前停车间隔',
        # '后停车间隔','前段短行程里程信息','后段短行程里程信息','前段短行程平均速度信息','后段短行程平均速度信息','前段短行程最高车速信息','后段短行程最高车速信息',
        # '前前段短行程里程信息','后后段短行程里程信息','前前段短行程平均速度信息','后后段短行程平均速度信息','前前段短行程最高车速信息','后后段短行程最高车速信息']
        # tezhengcanshu_jiaoqu = ['运行时间','运行距离','运行速度','加速时间','减速时间','匀速时间','怠速时间','加速比例','减速比例','匀速比例','怠速比例',
        # '最大速度','平均速度','速度标准偏差','最大加速度','加速段平均加速度','正加速度标准差','最大减速度','减速段平均减速度','负减速度标准差','平均dudt',
        # 'dudt标准偏差','speed0to20','speed20to40','speed40to60','speed60to80','speed80to100','speed100tomax','speed0','speed20to30','speed30to40',
        # 'speed40to50','speed50to60','speed60to70','speed70to80','speed80to90','speed90to100','speed100to110','speed110to120','speedup120',
        # '加速数目','减速数目','匀速数目','停车数目','转矩标准差','怠速段平均转矩','运行段平均转矩','正转矩时间比例','负转矩时间比例','转矩减小时最大波动量',
        # '转矩波动标准差','转矩增加时平均波动量','转矩减小时平均波动量','横摆角速度绝对值最大值','侧向加速绝对值最大值','制动次数','加速段时长','百公里能耗',
        # '前停车间隔','后停车间隔','前段短行程里程信息','后段短行程里程信息','前段短行程平均速度信息','后段短行程平均速度信息','前段短行程最高车速信息',
        # '后段短行程最高车速信息','后后段短行程里程信息','前前段短行程平均速度信息','后后段短行程平均速度信息','前前段短行程最高车速信息','后后段短行程最高车速信息']
        
        tezhengcanshu_gaosu = ['T','S','Vp','Ta','Td','Tc','Ti','Pa','Pd','Pc','Pi',
        'Vmax','Vm','Vsd','Amax','Amean_p','Asd_p','Amin','Amean_n','Asd_n',
        'Amean','Asd','Aop','P_0_20','P_20_40','P_40_60','P_60_80','P_80_100','P_100_','P_0',
        'P_0_10','P_10_20','P_20_30','P_30_40','P_40_50','P_50_60','P_60_70','P_70_80','P_80_90','P_90_100',
        'P_100_110','P_110_120','P_120_','Na','Nd','Nc','Ni','TqAll_sd','TqAll_m_p','TqAll_m_n','TqAll_max_p',
        'TqAll_max_n','TqAll_mean_i','TqAll_mean_c','P_TqAll_p','P_TqAll_n','DTqAll_max_a','DTqAll_max_d','DTqAll_sd',
        'DTqAll_mean_a','DTqAll_mean_d','Yawv_max','La_max','Bn','Tas','EC_per100','f_Ti',
        'b_Ti','f_S','b_S','f_Vm','b_Vm','f_Vmax','b_Vmax',
        'ff_S','bb_S','ff_Vm','bb_Vm','ff_Vmax','bb_Vmax']
        tezhengcanshu_jiaoqu = ['T','S','Vp','Ta','Td','Tc','Ti','Pa','Pd','Pc','Pi',
        'Vmax','Vm','Vsd','Amax','Amean_p','Asd_p','Amin','Amean_n','Asd_n','Amean',
        'Asd','P_0_20','P_20_40','P_40_60','P_60_80','P_80_100','P_100_','P_0','P_20_30','P_30_40',
        'P_40_50','P_50_60','P_60_70','P_70_80','P_80_90','P_90_100','P_100_110','P_110_120','P_120_',
        'Na','Nd','Nc','Ni','TqAll_sd','TqAll_mean_i','TqAll_mean_c','P_TqAll_p','P_TqAll_n','DTqAll_max_d',
        'DTqAll_sd','DTqAll_mean_a','DTqAll_mean_d','Yawv_max','La_max','Bn','Tas','EC_per100',
        'f_Ti','b_Ti','f_S','b_S','f_Vm','b_Vm','f_Vmax',
        'b_Vmax','bb_S','ff_Vm','bb_Vm','ff_Vmax','bb_Vmax']

        ###预测
        ###判断是否为高速
        n=[]
        for i in tezhengcanshu_gaosu:
            temp = tezhengchanshu.get(i)
            if temp == None:
                return (-4,'字段值异常')
            n.append(temp)
        gaosu_jiance = [n]
 
        gaosu_flag = itr_gaoshu.predict(gaosu_jiance)
        gaosu_lishudu = itr_gaoshu.predict_proba(gaosu_jiance)
        print('高速隶属度[高速，非高速]',gaosu_lishudu)
        if yuzhi[0]>=0.5 and yuzhi[1]>=0.5:
            if gaosu_lishudu[0,0] >= yuzhi[0]:            ###判断隶属度是否大于阈值，大于归高速类，否则归为非高速
                gaosu_flag = 0
            else:
                gaosu_flag = 1

        ###判断郊区山区
        if gaosu_flag == 1 :
            m=[]
            for i in tezhengcanshu_jiaoqu:
                temp = tezhengchanshu.get(i)
                if temp == None:
                    return (-4,'郊区山区字段值异常') 
                m.append(temp)
            jiaoqu_jiance = [m]  

            jiaoqu_shanqu_flag = itr_jiaoqu_shanqu.predict(jiaoqu_jiance) 
            jiaoqu_lishudu = itr_jiaoqu_shanqu.predict_proba(jiaoqu_jiance)
            print('郊区山区隶属度[郊区，山区]：',jiaoqu_lishudu)

            if yuzhi[0]>=0.5 and yuzhi[1]>=0.5:           ###判断隶属度是否大于阈值，郊区隶属度大于阈值归郊区类，山区隶属度大于阈值归山区类，否则归为0类
                if jiaoqu_lishudu[0,0] >= yuzhi[1]:
                    jiaoqu_shanqu_flag = 0
                elif jiaoqu_lishudu[0,1] >= yuzhi[1]:
                    jiaoqu_shanqu_flag = 1
                else:
                    jiaoqu_shanqu_flag = 2

        ###输出标签
        if gaosu_flag == 0:
            category = (2,'高速')
        elif jiaoqu_shanqu_flag == 0 :
            category = (3,'郊区')
        elif jiaoqu_shanqu_flag == 1:
            category = (4,'山区')
        elif jiaoqu_shanqu_flag == 2:
            category = (0,'在该城市')

        return category
            
def demo(data,yuzhi):
    ###定义PKL路径
    gaosu_moxing_name = 'data_train_car_gaosu.pkl'
    jiaoqu_moxing_name = 'data_train_car_jiaoqu.pkl'

    ###读取模型
    itr_gaoshu,itr_jiaoqu_shanqu = f_get_read_itr(gaosu_moxing_name,jiaoqu_moxing_name)

    ###输出结果
    result = bianshi(itr_gaoshu,itr_jiaoqu_shanqu,data,yuzhi)
    return result

if __name__ == '__main__':
    ###样本字典
    ###gaosu
    #0 9624 高速
    a_0 = {'T':1661,'S':30.9,'Vp':60.71582037,'Ta':461,'Td':466,'Tc':715.5,'Ti':18.5,'Pa':27.75436484,'Pd':28.05538832,'Pc':43.07645996,'Pi':1.113786875,
    'Vmax':105.3033416,'Vm':59.96646798,'Vsd':21.08034867,'Amax':1.084070772,'Amean_p':0.350115352,'Asd_p':0.199673639,'Amin':-2.028984312,'Amean_n':-0.399945554,
    'Asd_n':0.26939453,'Amean':-0.011596767,'Asd':0.337312747,'Aop':0.098437669,'P_0_20':4.33473811,'P_20_40':13.06441902,'P_40_60':33.59422035,'P_60_80':29.50030102,
    'P_80_100':18.48284166,'P_100_':1.023479831,'P_0':1.234196267,'P_0_10':1.655629139,'P_10_20':2.67910897,'P_20_30':5.237808549,'P_30_40':7.826610476,
    'P_40_50':8.488862131,'P_50_60':25.10535822,'P_60_70':17.8807947,'P_70_80':11.61950632,'P_80_90':11.86032511,'P_90_100':6.622516556,'P_100_110':1.023479831,
    'P_110_120':0,'P_120_':0,'Na':82,'Nd':77,'Nc':157,'Ni':1,'TqAll_sd':32.99337526,'TqAll_m_p':34.23638489,'TqAll_m_n':-21.03027888,'TqAll_max_p':177.2,'TqAll_max_n':-114.8,
    'TqAll_mean_i':-0.656756757,'TqAll_mean_c':21.95748247,'P_TqAll_p':77.27272727,'P_TqAll_n':22.66706803,'DTqAll_max_a':110.2,'DTqAll_max_d':-119.4,'DTqAll_sd':13.83034843,
    'DTqAll_mean_a':11.38972935,'DTqAll_mean_d':-8.852108108,'Yawv_max':7.5,'La_max':1.899,'Bn':19,'Tas':865.5,'EC_per100':17.18370433,'f_Ti':1,'b_Ti':1,'f_S':0.7,
    'b_S':0.6,'f_Vm':30.35765023,'b_Vm':15.01943073,'f_Vmax':47.52066744,'b_Vmax':59.00725023,'ff_S':1.2,'bb_S':0.5,'ff_Vm':31.88232532,'bb_Vm':26.37432214,
    'ff_Vmax':54.50929572,'bb_Vmax':68.98098315}

    # a_0 = {'运行时间':1661,'运行距离':30.9,'运行速度':60.71582037,'加速时间':461,'减速时间':466,'匀速时间':715.5,'怠速时间':18.5,'加速比例':27.75436484,'减速比例':28.05538832,
    # '匀速比例':43.07645996,'怠速比例':1.113786875,'最大速度':105.3033416,'平均速度':59.96646798,'速度标准偏差':21.08034867,'最大加速度':1.084070772,'加速段平均加速度':0.350115352,
    # '正加速度标准差':0.199673639,'最大减速度':-2.028984312,'减速段平均减速度':-0.399945554,'负减速度标准差':0.26939453,'平均dudt':-0.011596767,'dudt标准偏差':0.337312747,
    # '相对正加速度':0.098437669,'speed0to20':4.33473811,'speed20to40':13.06441902,'speed40to60':33.59422035,'speed60to80':29.50030102,'speed80to100':18.48284166,
    # 'speed100tomax':1.023479831,'speed0':1.234196267,'speed0to10':1.655629139,'speed10to20':2.67910897,'speed20to30':5.237808549,'speed30to40':7.826610476,
    # 'speed40to50':8.488862131,'speed50to60':25.10535822,'speed60to70':17.8807947,'speed70to80':11.61950632,'speed80to90':11.86032511,'speed90to100':6.622516556,
    # 'speed100to110':1.023479831,'speed110to120':0,'speedup120':0,'加速数目':82,'减速数目':77,'匀速数目':157,'停车数目':1,'转矩标准差':32.99337526,'平均正转矩':34.23638489,
    # '平均负转矩':-21.03027888,'最大正转矩':177.2,'最大负转矩':-114.8,'怠速段平均转矩':-0.656756757,'运行段平均转矩':21.95748247,'正转矩时间比例':77.27272727,
    # '负转矩时间比例':22.66706803,'转矩增加时最大波动量':110.2,'转矩减小时最大波动量':-119.4,'转矩波动标准差':13.83034843,'转矩增加时平均波动量':11.38972935,
    # '转矩减小时平均波动量':-8.852108108,'横摆角速度绝对值最大值':7.5,'侧向加速绝对值最大值':1.899,'制动次数':19,'加速段时长':865.5,'百公里能耗':17.18370433,'前停车间隔':1,
    # '后停车间隔':1,'前段短行程里程信息':0.7,'后段短行程里程信息':0.6,'前段短行程平均速度信息':30.35765023,'后段短行程平均速度信息':15.01943073,'前段短行程最高车速信息':47.52066744,
    # '后段短行程最高车速信息':59.00725023,'前前段短行程里程信息':1.2,'后后段短行程里程信息':0.5,'前前段短行程平均速度信息':31.88232532,'后后段短行程平均速度信息':26.37432214,
    # '前前段短行程最高车速信息':54.50929572,'后后段短行程最高车速信息':68.98098315}

    #1 8463	1 没选到
    a_1 = {'运行时间':463,'运行距离':5.7,'运行速度':48.52668252,'加速时间':231,'减速时间':96.5,'匀速时间':135.5,'怠速时间':0,'加速比例':49.89200864,'减速比例':20.84233261,
    '匀速比例':29.26565875,'怠速比例':0,'最大速度':74.25,'平均速度':44.07228942,'速度标准偏差':23.42249599,'最大加速度':2.36,'加速段平均加速度':0.472774892,
    '正加速度标准差':0.366088312,'最大减速度':-2.957,'减速段平均减速度':-0.699145078,'负减速度标准差':0.567123759,'平均dudt':0.096441685,'dudt标准偏差':0.586734413,
    '相对正加速度':0.228699576,'speed0to20':19.11447084,'speed20to40':18.57451404,'speed40to60':24.62203024,'speed60to80':37.68898488,'speed80to100':0,'speed100tomax':0,
    'speed0':9.179265659,'speed0to10':15.6587473,'speed10to20':3.455723542,'speed20to30':6.26349892,'speed30to40':12.31101512,'speed40to50':11.33909287,
    'speed50to60':13.28293737,'speed60to70':29.37365011,'speed70to80':8.315334773,'speed80to90':0,'speed90to100':0,'speed100to110':0,'speed110to120':0,'speedup120':0,
    '加速数目':81,'减速数目':40,'匀速数目':110,'停车数目':2,'转矩标准差':51.18605488,'平均正转矩':48.62898331,'平均负转矩':-25.53146067,'最大正转矩':204.7,'最大负转矩':-208.2,
    '怠速段平均转矩':0,'运行段平均转矩':29.74720571,'正转矩时间比例':71.1663067,'负转矩时间比例':28.8336933,'转矩增加时最大波动量':293.3,'转矩减小时最大波动量':-76.5,
    '转矩波动标准差':17.88350412,'转矩增加时平均波动量':11.70570652,'转矩减小时平均波动量':-7.936346154,'横摆角速度绝对值最大值':17.55,'侧向加速绝对值最大值':2.577,'制动次数':11,
    '加速段时长':300,'百公里能耗':25.3308845,'前停车间隔':13,'后停车间隔':1,'前段短行程里程信息':0.3,'后段短行程里程信息':1.2,'前段短行程平均速度信息':17.02159292,
    '后段短行程平均速度信息':49.45096386,'前段短行程最高车速信息':33.36,'后段短行程最高车速信息':76.72,'前前段短行程里程信息':0.8,'后后段短行程里程信息':2.4,
    '前前段短行程平均速度信息':17.60115016,'后后段短行程平均速度信息':45.82487047,'前前段短行程最高车速信息':40.05,'后后段短行程最高车速信息':69.8}
    #2 6683 1郊区
    a_2 = {'运行时间':53.5,'运行距离':0.8,'运行速度':34.25544444,'加速时间':12.5,'减速时间':25.5,'匀速时间':7.5,'怠速时间':8,'加速比例':23.36448598,'减速比例':47.6635514,
    '匀速比例':14.01869159,'怠速比例':14.95327103,'最大速度':56.42,'平均速度':28.81299065,'速度标准偏差':18.21879624,'最大加速度':1.655,'加速段平均加速度':0.79,
    '正加速度标准差':0.538762617,'最大减速度':-2.496,'减速段平均减速度':-1.125470588,'负减速度标准差':0.733713993,'平均dudt':-0.361205607,'dudt标准偏差':0.942804585,
    '相对正加速度':0.088646113,'speed0to20':32.71028037,'speed20to40':25.23364486,'speed40to60':42.05607477,'speed60to80':0,'speed80to100':0,'speed100tomax':0,
    'speed0':15.88785047,'speed0to10':22.42990654,'speed10to20':10.28037383,'speed20to30':12.14953271,'speed30to40':13.08411215,'speed40to50':33.64485981,
    'speed50to60':8.411214953,'speed60to70':0,'speed70to80':0,'speed80to90':0,'speed90to100':0,'speed100to110':0,'speed110to120':0,'speedup120':0,'加速数目':6,'减速数目':3,
    '匀速数目':8,'停车数目':1,'转矩标准差':47.23908709,'平均正转矩':33.77608696,'平均负转矩':-37.515,'最大正转矩':104.1,'最大负转矩':-118.9,'怠速段平均转矩':11.4125,
    '运行段平均转矩':-9.796666667,'正转矩时间比例':42.99065421,'负转矩时间比例':56.07476636,'转矩增加时最大波动量':65.9,'转矩减小时最大波动量':-61.1,'转矩波动标准差':20.15009655,
    '转矩增加时平均波动量':17.74634146,'转矩减小时平均波动量':-11.3296875,'横摆角速度绝对值最大值':2.2,'侧向加速绝对值最大值':0.38,'制动次数':4,'加速段时长':16,'百公里能耗':0,
    '前停车间隔':15,'后停车间隔':24.5,'前段短行程里程信息':3.1,'后段短行程里程信息':1.2,'前段短行程平均速度信息':38.60579787,'后段短行程平均速度信息':32.62758242,
    '前段短行程最高车速信息':67.39,'后段短行程最高车速信息':58.89,'前前段短行程里程信息':0.4,'后后段短行程里程信息':0.1,'前前段短行程平均速度信息':32.10722892,
    '后后段短行程平均速度信息':2.452604167,'前前段短行程最高车速信息':57.94,'后后段短行程最高车速信息':17.44}
    ###jiaoqu
    #0 2621 郊区
    b_0 = {'运行时间':88,'运行距离':0.1,'运行速度':11.92703704,'加速时间':9.5,'减速时间':4,'匀速时间':2,'怠速时间':72.5,'加速比例':10.79545455,'减速比例':4.545454545,'匀速比例':2.272727273,
    '怠速比例':82.38636364,'最大速度':17.89,'平均速度':1.829715909,'速度标准偏差':4.663582489,'最大加速度':1.438,'加速段平均加速度':0.683842105,'正加速度标准差':0.413642128,'最大减速度':-1.709,
    '减速段平均减速度':-0.7055,'负减速度标准差':0.214165992,'平均dudt':0.018721591,'dudt标准偏差':0.31780626,'speed0to20':100,'speed20to40':0,'speed40to60':0,'speed60to80':0,'speed80to100':0,
    'speed100tomax':0,'speed0':84.65909091,'speed20to30':0,'speed30to40':0,'speed40to50':0,'speed50to60':0,'speed60to70':0,'speed70to80':0,'speed80to90':0,'speed90to100':0,'speed100to110':0,
    'speed110to120':0,'speedup120':0,'加速数目':4,'减速数目':2,'匀速数目':4,'停车数目':1,'转矩标准差':35.06491611,'怠速段平均转矩':0.303448276,'运行段平均转矩':87.9037037,'正转矩时间比例':23.29545455,
    '负转矩时间比例':76.70454545,'转矩减小时最大波动量':-50.2,'转矩波动标准差':11.8946258,'转矩增加时平均波动量':6.513559322,'转矩减小时平均波动量':-5.603333333,'横摆角速度绝对值最大值':30.4,
    '侧向加速绝对值最大值':1.628,'制动次数':4,'加速段时长':11.5,'百公里能耗':0,'前停车间隔':1.5,'后停车间隔':0.5,'前段短行程里程信息':0.1,'后段短行程里程信息':0.6,'前段短行程平均速度信息':2.742380952,
    '后段短行程平均速度信息':25.29552795,'前段短行程最高车速信息':5.01,'后段短行程最高车速信息':58.55,'后后段短行程里程信息':0.3,'前前段短行程平均速度信息':7.227461538,
    '后后段短行程平均速度信息':3.022166667,'前前段短行程最高车速信息':25.09,'后后段短行程最高车速信息':70.87}
    #1 6454 山区
    b_1 = {'运行时间':291,'运行距离':2.1,'运行速度':25.62687818,'加速时间':70,'减速时间':152,'匀速时间':69,'怠速时间':0,'加速比例':24.05498282,'减速比例':52.23367698,'匀速比例':23.71134021,'怠速比例':0,
    '最大速度':40.42745782,'平均速度':25.45074844,'速度标准偏差':8.86442037,'最大加速度':0.991217528,'加速段平均加速度':0.519117575,'正加速度标准差':0.268027608,'最大减速度':-0.777425332,
    '减速段平均减速度':-0.404571333,'负减速度标准差':0.200448799,'平均dudt':-0.09313911,'dudt标准偏差':0.410884509,'speed0to20':22.33676976,'speed20to40':75.60137457,'speed40to60':2.06185567,
    'speed60to80':0,'speed80to100':0,'speed100tomax':0,'speed0':0.687285223,'speed20to30':48.96907216,'speed30to40':26.63230241,'speed40to50':2.06185567,'speed50to60':0,'speed60to70':0,
    'speed70to80':0,'speed80to90':0,'speed90to100':0,'speed100to110':0,'speed110to120':0,'speedup120':0,'加速数目':4,'减速数目':7,'匀速数目':10,'停车数目':2,'转矩标准差':41.18899589,
    '怠速段平均转矩':0,'运行段平均转矩':3.521626298,'正转矩时间比例':39.51890034,'负转矩时间比例':60.48109966,'转矩减小时最大波动量':-38.6,'转矩波动标准差':7.136858616,'转矩增加时平均波动量':4.301498127,
    '转矩减小时平均波动量':-3.600993377,'横摆角速度绝对值最大值':15.5,'侧向加速绝对值最大值':1.275,'制动次数':7,'加速段时长':98,'百公里能耗':1.727294312,'前停车间隔':0,'后停车间隔':0,
    '前段短行程里程信息':2,'后段短行程里程信息':0.1,'前段短行程平均速度信息':27.59060315,'后段短行程平均速度信息':5.629355933,'前段短行程最高车速信息':45.31784405,'后段短行程最高车速信息':11.6113021,
    '后后段短行程里程信息':0.1,'前前段短行程平均速度信息':7.20003662,'后后段短行程平均速度信息':3.560575444,'前前段短行程最高车速信息':19.89943022,'后后段短行程最高车速信息':9.953258215}
    
    yuzhi = [0.6,0.65]         ###阈值[高速阈值0.6 郊区山区阈值0.65]
    result = demo(a_0,yuzhi)
    print(result)
